---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceRoughness
source: html/0d30b43d-58fa-2419-6536-a15d0562262c.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceRoughness Property

The property labeled "Roughness" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public static string SurfaceRoughness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.